БухЭксп/InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СложныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСДо2014Года</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСНаСчете19</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьНоменклатуруПоОперациям0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпрощенныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПоОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПриПередачеНедвижимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьДолюВычета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезопаснаяДоляВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСБезВычетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРегистрацииСводныхСправок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_Оплата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_КурсовыеРазницы</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаВходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатыПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>InformationRegister.CW_РаспределениеОплатПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПодборСчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПодборАктов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДерева</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОтраженияАвансов</v8:Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАванса</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата_БВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Comment>НДС (в валюте оплаты)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/CommonForms/CW_ФормаПодбораСчетовДляОплаты/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.ОпределитьВозможностьОткрытияОбъектаМодуля(Тип("ДокументМенеджер.ПоступлениеНаРасчетныйСчет"),,Отказ);

	БазоваяВалюта 	= CW_Настройки.ВалютаРегламентированногоУчета();
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям 				= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ГруппаОрганизация.Видимость 	= ВестиУчетПоПодразделениям;
	
	Параметры.Свойство("ПодразделениеОрганизации",ПодразделениеОрганизации);
	Элементы.ПодразделениеОрганизации.ТолькоПросмотр = ЗначениеЗаполнено(ПодразделениеОрганизации);
	//Для версии КОРП
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры,"Организация,Контрагент,Договор,Валюта,ВалютаДокумента,Представление,Дата,ВедомыйДокумент,СтатьяДДС,ВидОперации");
	
	//Подсистема.УчетПриложенийДоговоров
	УстановитьВидимостьПриложения();
	
	ПриложениеКДоговору = Параметры.ПриложениеКДоговору; 
	//Подсистема.УчетПриложенийДоговоров    
	
	
	Параметры.Свойство("СуммаОплаты",СуммаОплаты);
	Параметры.Свойство("ПлатежноеПоручение",ПлатежноеПоручение);
	Если (ВедомыйДокумент <> Неопределено) Тогда
		АвтоматическийПодборСчетов = ВедомыйДокумент.АвтоматическийПодборСчетов;
		АвтоматическийПодборАктов = ВедомыйДокумент.АвтоматическийПодборАктов;
	Иначе
		АвтоматическийПодборСчетов = Ложь;
		АвтоматическийПодборАктов = Ложь;
	КонецЕсли; 
	
	//Параметры выбора договора
	Если ТипЗнч(ПлатежноеПоручение) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;	
	ИначеЕсли ТипЗнч(ПлатежноеПоручение) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;	
	КонецЕсли;  
	
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.БухгалтерскийУчет", Истина));
	
	Если ВидДоговора <> Неопределено Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ВидДоговора));
	КонецЕсли;
	
	Если ВалютаДокумента <> БазоваяВалюта Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВзаиморасчетыВУЕ", ЛОЖЬ));
	КонецЕсли;
	//Параметры выбора договора
	
	УстановитьПараметрыБухгалтерскогоУчета();
	
	ТаблицаОЗ 		= ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыОЗ);
	АдресТаблицыОЗ 	= ПоместитьВоВременноеХранилище(ТаблицаОЗ,ЭтаФорма.УникальныйИдентификатор);
	
	СН 		= CW_Настройки.ПараметрГлобальнойУчетнойПолитики(Дата,Организация,"СистемаНалогообложения");
	ОСНО 	= СН = Перечисления.СистемыНалогообложения.Общая;   
	
	Если Не ПриложениеКДоговору.Пустая() Тогда
		УстановитьПараметриыПриложенияДоговора(ПриложениеКДоговору);
	Иначе
		УстановитьПараметриыПриложенияДоговора(Договор);
	КонецЕсли;
	
	// восстанавливаем настройки
	_ВосстановитьНастройки();
	
	РежимДДС = (_сф.ст_ПолучитьСвойство(Параметры,"РежимДДС"));
	Если (РежимДДС = Неопределено) Тогда
		РежимДДС = Ложь;
	КонецЕсли; 
	Если (РежимДДС) Тогда
		ВалютаКассы = _сф.ст_ПолучитьСвойство(Параметры,"ВалютаКассы");
		Элементы.Валюта.Видимость = (Валюта <> ВалютаКассы);
		Элементы.КроссКурс.Видимость = (Валюта <> ВалютаКассы);
		Если (Элементы.КроссКурс.Видимость) Тогда
			
			КурсВД = CW_Финансы.ПолучитьКурсВалюты(Валюта,Дата);
			КурсВК = CW_Финансы.ПолучитьКурсВалюты(ВалютаКассы,Дата);
			
			КроссКурс = _сф.БезопасноРазделить(КурсВД.Курс,КурсВК.Курс)*_сф.БезопасноРазделить(КурсВК.Кратность,КурсВД.Кратность);
			
		КонецЕсли; 
		Элементы.ВалютаКассы.Видимость = Истина;
		Элементы.ДеревоОплатОплата_БВ.Заголовок = "Оплата, "+Строка(ВалютаКассы);
		Элементы.ДеревоОплатКурс.Видимость = (Ложь);
		Элементы.ДеревоОплатОплата_БВ.Видимость = (Валюта <> ВалютаКассы);
		Элементы.СтатьяДДС.Видимость = Ложь;
		Элементы.ПорядокОтраженияАванса.Видимость = Ложь;
	Иначе
		Элементы.Валюта.Видимость = (Валюта <> БазоваяВалюта И УЕ);
		Элементы.ВалютаКассы.Видимость = Ложь;
		Элементы.КроссКурс.Видимость = Ложь;
		Элементы.ДеревоОплатОплата_БВ.Заголовок = "Оплата, "+Строка(БазоваяВалюта);
		Элементы.ДеревоОплатКурс.Видимость = УЕ;
		Элементы.ДеревоОплатОплата_БВ.Видимость = УЕ;
		БУ = CW_Конфигурация.ПланСчетов().Касса;
		ВестиУчетПоСтатьямДДС = НЕ (БУ.ВидыСубконто.Найти(CW_Конфигурация.ВидыСубконто().СтатьиДвиженияДенежныхСредств, "ВидСубконто") = Неопределено);
		Элементы.СтатьяДДС.Видимость = (ВестиУчетПоСтатьямДДС);
		УСН = (СН = Перечисления.СистемыНалогообложения.Упрощенная И Договор.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		Элементы.ПорядокОтраженияАванса.Видимость = УСН;
	КонецЕсли; 
	
	Если (Договор.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком) Тогда
		ПустойАкт = Документы.CW_РасходыПоГрузоперевозке.ПустаяСсылка();
		Если (РежимДДС) Тогда
			ПлатежноеПоручение = Документы.СписаниеСРасчетногоСчета.ПустаяСсылка();
		КонецЕсли; 
	Иначе
		ПустойАкт = Документы.CW_ДоходыПоГрузоперевозке.ПустаяСсылка();
		Если (РежимДДС) Тогда
			ПлатежноеПоручение = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли; 
	
	УстаноитьЗаголовкиЭлементов();
	
	_УправлениеЭлементамиФормы();
	_ОбновитьДерево();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыБухгалтерскогоУчета()
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета  	= CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	ПоДоговоруВедетсяБУ 			= ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет;
	УчетныйДоговор 					= ПараметрыБухгалтерскогоУчета.УчетныйДоговор;

КонецПроцедуры

&НаСервере
Процедура УстаноитьЗаголовкиЭлементов()
	
	Элементы.ДеревоОплатЗадолженность.Заголовок = "Задолженность, "+Строка(Валюта);
	Элементы.ДеревоОплатОплата_Валюта.Заголовок = "Оплата, "+Строка(Валюта);
	Элементы.ДеревоОплатСуммаНДС.Заголовок = "НДС, "+?(Договор.ВзаиморасчетыВУЕ,"Руб.", Строка(Валюта));
	
	Элементы.ДеревоОплатСтавкаНДС.Видимость = ПоДоговоруВедетсяБУ и НЕ РежимДДС;
	Элементы.ДеревоОплатСуммаНДС.Видимость 	= ПоДоговоруВедетсяБУ и НЕ РежимДДС;
	
	УстановитьПараметрыВыбораСтавкиНДС();

КонецПроцедуры  

&НаСервере
Процедура УстановитьПараметрыВыбораСтавкиНДС() Экспорт
	
	ПараметрНДСПриУСН = Новый ПараметрВыбора("СтавкаНДСПриУСН",
		РегистрыСведений.НастройкиУчетаНДС.СтавкаНалогообложенияПриУСН(Организация, Дата));
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(ПараметрНДСПриУСН);
	
	Если ПолучитьФункциональнуюОпцию("ОсуществляетсяРеализацияТоваровУслугКомитентов")
		И УчетНДСКлиентСервер.Применяется176ФЗ(Дата) Тогда
		ОсуществляетсяРеализацияТоваровУслугКомитентов = Новый ПараметрВыбора("ОсуществляетсяРеализацияТоваровУслугКомитентов", Истина);
		МассивПараметровВыбора.Добавить(ОсуществляетсяРеализацияТоваровУслугКомитентов);
	КонецЕсли;
	
	Элементы["ДеревоОплатСтавкаНДС"].ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);

КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	_СохранитьНастройки();
	
КонецПроцедуры

&НаСервере
Функция _ВосстановитьНастройки()
	// --- 
	
	Попытка
		
		ИмяНастройки="ПоследняяНастройка";
		ПоследняяНастройка = ХранилищеСистемныхНастроек.Загрузить("ОбщаяФорма.ПодборСчетовДляОплаты", ИмяНастройки);
		ПоследняяНастройка.Свойство("СтрокиСвернуты",СтрокиСвернуты);
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки; 
	
	// --- 
КонецФункции

&НаСервере
Функция _СохранитьНастройки()
	// --- 
	
	ИмяНастройки="ПоследняяНастройка";
	Настройка = Новый Структура("СтрокиСвернуты",СтрокиСвернуты);
	ХранилищеСистемныхНастроек.Сохранить("ОбщаяФорма.ПодборСчетовДляОплаты", ИмяНастройки, Настройка);
	
	// --- 
КонецФункции
 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	// колонка "Сумма по документу"
	Элементы.ДеревоОплатСуммаДокумента.Видимость 	= Элементы.ДеревоОплатКомандаСуммыДокументов.Пометка;
	//Элементы.ДеревоОплатСуммаНДС.Видимость 			= Элементы.ДеревоОплатКомандаСуммыДокументов.Пометка;
	Элементы.ДеревоОплатКомандаСуммыДокументов.Заголовок = ?(Элементы.ДеревоОплатКомандаСуммыДокументов.Пометка, " Скрыть", " Показать");
	// --- 
	Элементы.АвтоматическийПодборСчетов.Доступность = (СуммаОплаты <> 0);
	Элементы.ДеревоОплатОплата_Валюта.ТолькоПросмотр = АвтоматическийПодборСчетов;
	Элементы.ДеревоОплатОплата_БВ.ТолькоПросмотр = АвтоматическийПодборСчетов;
	
	Элементы.Валюта.Видимость 				= (Валюта <> БазоваяВалюта И УЕ);
	Элементы.ДеревоОплатКурс.Видимость 		= УЕ;
	Элементы.ДеревоОплатОплата_БВ.Видимость = УЕ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	_ОбновитьДерево();
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьДерево()
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;
	
	СК = CW_Финансы.ПолучитьКурсВалюты(Валюта,Дата);
	
	ЕстьВедомый = (ЗначениеЗаполнено(ВедомыйДокумент));
	ТаблицаВедомого = ВедомыйДокумент.Оплата.Выгрузить();
	
	// определение статьи ДДС
	Если (ЗначениеЗаполнено(ВедомыйДокумент.Основание)) Тогда
		ТаблицаСтатейДДС = ВедомыйДокумент.Основание.РасшифровкаПлатежа.Выгрузить(,"СтатьяДвиженияДенежныхСредств");
		ТаблицаСтатейДДС.Свернуть("СтатьяДвиженияДенежныхСредств");
		Если (ТаблицаСтатейДДС.Количество() <> 0) Тогда
			СтатьяДДС = _сф.к_ПервыйЭлемент(ТаблицаСтатейДДС).СтатьяДвиженияДенежныхСредств;	
		КонецЕсли; 
	КонецЕсли; 
	
	// определение порядка отражения аванса
	Если (Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем И ЗначениеЗаполнено(ВедомыйДокумент.Основание) И УСН) Тогда
		ТаблицаПОА = ВедомыйДокумент.Основание.РасшифровкаПлатежа.Выгрузить(,"ПорядокОтраженияАванса");
		ТаблицаПОА.Свернуть("ПорядокОтраженияАванса");
		Если (ТаблицаПОА.Количество() <> 0) Тогда
			ПорядокОтраженияАванса = _сф.к_ПервыйЭлемент(ТаблицаПОА).ПорядокОтраженияАванса;	
		КонецЕсли; 
	КонецЕсли; 
	
	// если не удалось определить порядок отражения аванса (такая ситуация возможна для нового документа), 
	// то устанавливаем порядок, указанный в учетной политике организации
	Если Не ЗначениеЗаполнено(ПорядокОтраженияАванса) И 
		(Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) И УСН
	Тогда
		ДанныеУчетнойполитики = CW_Настройки.ПараметрыУчетнойПолитики(?(Дата='00010101000000', ТекущаяДата(), Дата),Организация);
		ПорядокОтраженияАванса = ДанныеУчетнойполитики["ПорядокОтраженияАванса"];
	КонецЕсли;
	         
	ТаблицаОЗ = ПолучитьИзВременногоХранилища(АдресТаблицыОЗ);
	Если ТаблицаОЗ <> Неопределено Тогда
		ТаблицаВедомого = ТаблицаОЗ;
	КонецЕсли; 
	
	ПараметрыТОЗ = Новый Структура;
	_сф.ст_ДобавитьСвойства(ПараметрыТОЗ,"Организация,Контрагент,Договор,Валюта",ЭтаФорма);
	
	//Подсистема.УчетПриложенийДоговоров
	ПараметрыТОЗ.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров

	
	Если (ЗначениеЗаполнено(ПлатежноеПоручение) И ЕстьВедомый) Тогда
		ПараметрыТОЗ.Вставить("Дата",ВедомыйДокумент.МоментВремени());
	Иначе
		ПараметрыТОЗ.Вставить("Дата",Дата);
	КонецЕсли; 
	
	//Для версии КОРП
	Если ВестиУчетПоПодразделениям Тогда
		ПараметрыТОЗ.Вставить("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);
		ПараметрыТОЗ.Вставить("ПодразделениеОрганизации"	, ПодразделениеОрганизации);
	КонецЕсли;
	//Для версии КОРП

	ПараметрыТОЗ.Вставить("ВидОперации",ВидОперации);
	
	ТОЗ = CW_Финансы.ТаблицаОперативнойЗадолженностиПоСчетам(ПараметрыТОЗ);
	
	// теперь получим акты, соответствующие счетам
	Если (НЕ РежимДДС) Тогда
		
		ПараметрыТЗА = Новый Структура;
		_сф.ст_ДобавитьСвойства(ПараметрыТЗА,"Организация,Контрагент,Договор,ПриложениеКДоговору,Валюта",ЭтаФорма);
		ПараметрыТЗА.Вставить("Дата", ПлатежноеПоручение.МоментВремени());
		ПараметрыТЗА.Вставить("ТОЗ",ТОЗ);

		СтруктураБЗ = CW_Финансы.СтруктураБухгалтерскойЗадолженностиПоАктам(ПараметрыТЗА);
		ТА = СтруктураБЗ.ТА;
		ТЗА = СтруктураБЗ.ТЗА;
		
	КонецЕсли; 
	
	СтавкаНДС = CW_БухгалтерияЭкспедитораДляРоссииСервер.СтавкаНДСПоВидуСтавки(Перечисления.ВидыСтавокНДС.Общая, Дата);
	
	ПараметрыДО = Новый Структура;
	ПараметрыДО.Вставить("РежимДДС",РежимДДС);
	ПараметрыДО.Вставить("Курс",СК.Курс);
	ПараметрыДО.Вставить("Кратность",СК.Кратность);
	ПараметрыДО.Вставить("ЕстьВедомый",ЕстьВедомый);
	ПараметрыДО.Вставить("ТаблицаВедомого",ТаблицаВедомого);
	ПараметрыДО.Вставить("ПустойАкт",ПустойАкт);
	ПараметрыДО.Вставить("УЕ",УЕ);
	ПараметрыДО.Вставить("ТОЗ",ТОЗ);
	ПараметрыДО.Вставить("ТА",ТА);
	ПараметрыДО.Вставить("ТЗА",ТЗА);
	ПараметрыДО.Вставить("Организация",Организация);
	ПараметрыДО.Вставить("Договор",Договор);
	ПараметрыДО.Вставить("Валюта",Валюта);
	ПараметрыДО.Вставить("БазоваяВалюта",БазоваяВалюта);
	ПараметрыДО.Вставить("Дата",Дата);
	ПараметрыДО.Вставить("СтавкаНДС",СтавкаНДС);
	
	CW_Финансы.СформироватьДеревоОплат(ДеревоОплат,ПараметрыДО);
	
	ОбновитьИтоги();

КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеОрганизацииПриИзменении(Элемент)
	_ОбновитьДерево();
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	Попытка
		
		ПоказатьЗначение(,Элементы.ДеревоОплат.ТекущиеДанные.Документ);
		
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатПриИзменении(Элемент)
	
	ОбновитьИтоги();
	
КонецПроцедуры

Процедура ОбновитьИтоги()
	// --- 
	
	Оплачено_Валюта = 0;
	Оплачено_БВ 	= 0;
	ИтогоСумма		= 0;
	// --- 
	
	Для каждого Стр Из ДеревоОплат.ПолучитьЭлементы() Цикл
		
		Оплачено_Валюта = Оплачено_Валюта+Стр.Оплата_Валюта;
		Если УЕ ИЛИ РежимДДС Тогда
			
			Оплачено_БВ = Оплачено_БВ + Стр.Оплата_БВ;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если УЕ ИЛИ РежимДДС Тогда
		ИтогоСумма = Оплачено_БВ;
	Иначе
		ИтогоСумма = Оплачено_Валюта;
	КонецЕсли; 
	
	Если (РежимДДС) Тогда
		
		Итого = "Оплачено, "+Строка(Валюта)+": "+Формат(Оплачено_Валюта,"ЧЦ=15; ЧДЦ=2; ЧН=");
		Если (Валюта <> ВалютаКассы) Тогда
			
			Итого = Итого+", "+Строка(ВалютаКассы)+": "+Формат(Оплачено_БВ,"ЧЦ=15; ЧДЦ=2; ЧН=");
			
		КонецЕсли; 
		
	Иначе
		
		Итого = "Оплачено, "+Строка(Валюта)+": "+Формат(Оплачено_Валюта,"ЧЦ=15; ЧДЦ=2; ЧН=");
		Если УЕ Тогда
			
			Итого = Итого+", "+Строка(БазоваяВалюта)+": "+Формат(Оплачено_БВ,"ЧЦ=15; ЧДЦ=2; ЧН=");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если (СуммаОплаты <> 0) и (СуммаОплаты <> ИтогоСумма) тогда
		
		Если УЕ ИЛИ РежимДДС Тогда
			тВалюта = БазоваяВалюта;
		Иначе
			тВалюта = Валюта;
		КонецЕсли;	
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПодтвержденияОплаты", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Итоговая сумма оплаты "+Формат(ИтогоСумма, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00")+ " " + тВалюта + 
		" отличается от суммы в документе "+Формат(СуммаОплаты, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00")+" " + тВалюта + ".
		|Продолжить?", Режим, 0); 
		
	Иначе
		Ответ = _ПодтвердитьОплату();
		Если _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			ЭтаФорма.Закрыть(Ответ);
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПодтвержденияОплаты(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Ответ = _ПодтвердитьОплату();
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда
		
		ЭтаФорма.Закрыть(Ответ);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПодтвердитьОплату()
	// --- 
	
	Если (НЕ РежимДДС) Тогда
		
		СК = CW_Финансы.ПолучитьКурсВалюты(Валюта,Дата);
		
		// формируем таблицу оплат по оперативной задолженности
		ТаблицаОЗ = Документы.CW_Оплата.ПустаяСсылка().Оплата.Выгрузить();
		
		// подготовим табличную часть в зависимости от ведущего документа
		Если ТипЗнч(ПлатежноеПоручение) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
			ТабличнаяЧасть = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка().РасшифровкаПлатежа.Выгрузить();
		Иначе
			ТабличнаяЧасть = Документы.СписаниеСРасчетногоСчета.ПустаяСсылка().РасшифровкаПлатежа.Выгрузить();
		КонецЕсли; 
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Договор"					, Договор);
		//Подсистема.УчетПриложенийДоговоров
		ПараметрыЗаполнения.Вставить("ПриложениеКДоговору"		, ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров
		ПараметрыЗаполнения.Вставить("СтатьяДДС"				, СтатьяДДС);
		ПараметрыЗаполнения.Вставить("ПорядокОтраженияАванса"	, ПорядокОтраженияАванса);
		ПараметрыЗаполнения.Вставить("УЕ"						, УЕ);
		ПараметрыЗаполнения.Вставить("ПустойАкт"				, ПустойАкт);
		ПараметрыЗаполнения.Вставить("Курс"						, СК.Курс);
		ПараметрыЗаполнения.Вставить("Кратность"				, СК.Кратность);
		ПараметрыЗаполнения.Вставить("ТипДокумента"				, ТипЗнч(ПлатежноеПоручение));
		
		CW_Финансы.ЗаполнитьТаблицыПлатежныхДокументов(ДеревоОплат,ТаблицаОЗ,ТабличнаяЧасть, ПараметрыЗаполнения);
		
		СтруктураПараметров = Новый Структура("ВедомыйДокумент,Реквизиты,ТаблицаДокумента,ТаблицаПоОперативнойЗадолженности");
		
		Реквизиты = _сф.ст_Создать("Организация,Контрагент,Договор,Валюта,АвтоматическийПодборСчетов,АвтоматическийПодборАктов,ПорядокОтраженияАванса",ЭтаФорма);
		
		//Подсистема.УчетПриложенийДоговоров
		Реквизиты.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров

		
		//Для версии КОРП
		Если ВестиУчетПоПодразделениям Тогда
			Реквизиты.Вставить("ПодразделениеОрганизации", ПодразделениеОрганизации);
		КонецЕсли;
		//Для версии КОРП
		
		СтруктураПараметров.ВедомыйДокумент 					= ВедомыйДокумент;
		СтруктураПараметров.Реквизиты 							= Реквизиты;
		СтруктураПараметров.ТаблицаПоОперативнойЗадолженности 	= ТаблицаОЗ;
		СтруктураПараметров.ТаблицаДокумента 					= ТабличнаяЧасть;
		
		// --- 
		Ответ = _УФКС.Ответ();
		Ответ.Вставить("АдресПараметровОплаты",ПоместитьВоВременноеХранилище(СтруктураПараметров,ЭтаФорма.УникальныйИдентификатор));
		
		Возврат(Ответ);
		
	КонецЕсли; 
	
	Если (РежимДДС) Тогда
		
		ТаблицаДокумента = Документы.CW_ДвижениеДенежныхСредств.ПустаяСсылка().Расшифровка.Выгрузить();
		Для каждого СтрокаСчета Из ДеревоОплат.ПолучитьЭлементы() Цикл
			
			СуммаОплатыПоСчету = СтрокаСчета.Оплата_Валюта;
			СуммаОплатыПоСчету_БВ = СтрокаСчета.Оплата_БВ;
			// --- 
			ОстатокОплаты = СуммаОплатыПоСчету;
			ОстатокОплаты_БВ = СуммаОплатыПоСчету_БВ;
			Если (ОстатокОплаты > 0) Тогда
				
				Нстр = ТаблицаДокумента.Добавить();
				// --- 
				Нстр.Документ = СтрокаСчета.Документ;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаСчета.Документ,"ПредставлениеДокумента") Тогда
					Нстр.Представление = СтрокаСчета.Документ.ПредставлениеДокумента;
				Иначе
					Нстр.Представление = Строка(СтрокаСчета.Документ);
				КонецЕсли;
				Если (НЕ ЗначениеЗаполнено(СтрокаСчета.Документ)) Тогда
					Нстр.Представление = СтрокаСчета.Представление;
				КонецЕсли; 
				Нстр.Счет = СтрокаСчета.СчетЗадолженности;
				Если (ВалютаКассы = Валюта) Тогда
					Нстр.СуммаВД = ОстатокОплаты;
					Нстр.СуммаВК = ОстатокОплаты;
				Иначе
					Нстр.СуммаВД = ОстатокОплаты;
					Нстр.СуммаВК = ОстатокОплаты_БВ;
				КонецЕсли; 
				// --- 
				
			КонецЕсли; 
			
		КонецЦикла; 
		Ответ = _УФКС.Ответ();
		Ответ.Вставить("АдресТаблицыДокумента",ПоместитьВоВременноеХранилище(ТаблицаДокумента,ЭтаФорма.УникальныйИдентификатор));
		Возврат(Ответ);
		
	КонецЕсли; 
	
	// --- 

КонецФункции


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ДеревоОплатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.ДеревоОплат.ТекущиеДанные;
	
	Если Поле = Элементы.ДеревоОплатСуммаДокумента Тогда
		
		Если (ТД.СуммаДокумента > 0) Тогда
			
			ТД.Оплата_Валюта = ТД.СуммаДокумента;
			_ПроверитьКорректностьОплаты(Элементы.ДеревоОплат.ТекущаяСтрока);	
			
			ПересчитатьСтавкуНДСПоСтроке(Элементы.ДеревоОплат.ТекущаяСтрока);
	
		КонецЕсли; 
			
	ИначеЕсли Поле = Элементы.ДеревоОплатЗадолженность Тогда
		
		Если (ТД.Задолженность > 0) Тогда
			
			ТД.Оплата_Валюта = ТД.Задолженность;
			_ПроверитьКорректностьОплаты(Элементы.ДеревоОплат.ТекущаяСтрока);
			
			ПересчитатьСтавкуНДСПоСтроке(Элементы.ДеревоОплат.ТекущаяСтрока);
	
		КонецЕсли; 
		
	КонецЕсли; 
	
	ОбновитьИтоги();
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоОплатОплата_ВалютаПриИзменении(Элемент)
	
	// необходимо проверить, если это счёт, то сумма оплаты не должна превышать сумму оплаты по подчинённым актам,
	// если акт - аналогично
	Ответ = _ПроверитьКорректностьОплаты(Элементы.ДеревоОплат.ТекущаяСтрока);  
	
	ПересчитатьСтавкуНДСПоСтроке(Элементы.ДеревоОплат.ТекущаяСтрока);
	
	ОбновитьИтоги();
	Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
		
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПроверитьКорректностьОплаты(ТС)   
	
	СтрокаДерева = ДеревоОплат.НайтиПоИдентификатору(ТС);
	// --- 
	Если (СтрокаДерева.Оплата_Валюта <= 0) Тогда
		
		СтрокаДерева.Оплата_Валюта = 0;
		СтрокаДерева.Оплата_БВ = 0;		
			
	КонецЕсли; 
	Если (СтрокаДерева.Оплата_БВ < 0) Тогда
		
		СтрокаДерева.Оплата_БВ = 0;	
		
	КонецЕсли; 
	
	//Для получения кратности
	СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(Валюта,Дата);
	//Для получения кратности
	
	
	// --- 
	Если (РежимДДС) Тогда
		
		// пересчитываем по кросс-курсу из шапки
		СтрокаДерева.Курс = КроссКурс;
		СтрокаДерева.Оплата_БВ = Окр(СтрокаДерева.Оплата_Валюта*СтрокаДерева.Курс / СтруктураКурса.Кратность, 2);
		
	Иначе
		
		Если УЕ Тогда
			
			Если СтрокаДерева.Курс = 0 Тогда
				
				СтрокаДерева.Курс 		= СтруктураКурса.Курс;
				СтрокаДерева.Оплата_БВ 	= ОКР(СтрокаДерева.Оплата_Валюта*СтрокаДерева.Курс / СтруктураКурса.Кратность, 2);
				
			Иначе
				
				Если СтрокаДерева.Оплата_БВ = 0 Тогда
					
					СтрокаДерева.Оплата_БВ = ОКР(СтрокаДерева.Оплата_Валюта*СтрокаДерева.Курс / СтруктураКурса.Кратность, 2);
					
				Иначе
					
					СтрокаДерева.Курс = _сф.БезопасноРазделить(СтрокаДерева.Оплата_БВ,СтрокаДерева.Оплата_Валюта) * СтруктураКурса.Кратность;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
	Если СтрокаДерева.ЭтоСчет Тогда
		
		ОплатаПоСчету = СтрокаДерева.Оплата_Валюта;
		ОплатаПоАктам = 0;
		Для каждого СтрокаАкта Из СтрокаДерева.ПолучитьЭлементы() Цикл
			
			_сф.Инкремент(ОплатаПоАктам,СтрокаАкта.Оплата_Валюта);
			
		КонецЦикла; 
		Если ОплатаПоАктам > ОплатаПоСчету Тогда
			
			СтрокаДерева.Оплата_Валюта = ОплатаПоАктам;
			_ПроверитьКорректностьОплаты(СтрокаДерева.ПолучитьИдентификатор());
			
		КонецЕсли; 
				
	Иначе
		
		СтрокаСчета = СтрокаДерева.ПолучитьРодителя();
		ОплатаПоСчету = СтрокаСчета.Оплата_Валюта;
		ОплатаПоАктам = 0;
		Для каждого СтрокаАкта Из СтрокаСчета.ПолучитьЭлементы() Цикл
			
			_сф.Инкремент(ОплатаПоАктам,СтрокаАкта.Оплата_Валюта);
			
		КонецЦикла; 
		Если ОплатаПоАктам > ОплатаПоСчету Тогда
			
			СтрокаСчета.Оплата_Валюта = ОплатаПоАктам;
			_ПроверитьКорректностьОплаты(СтрокаСчета.ПолучитьИдентификатор());
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат _УФКС.Ответ();

КонецФункции

// --- 

&НаКлиенте
Процедура ДеревоОплатОплата_БВПриИзменении(Элемент)
	
	Ответ = _ПроверитьКорректностьОплаты_БВ(Элементы.ДеревоОплат.ТекущаяСтрока);   
	
	ПересчитатьСтавкуНДСПоСтроке(Элементы.ДеревоОплат.ТекущаяСтрока, "БВ");
	
	ОбновитьИтоги();
	
КонецПроцедуры     

&НаСервере
Процедура ПересчитатьСтавкуНДСПоСтроке(ИдентификаторСтроки, Постфикс="Валюта") 
	
	ПостфиксЗадолженность = ?(Постфикс="Валюта", "", "_"+Постфикс);
	
	СтрокаДерева = ДеревоОплат.НайтиПоИдентификатору(ИдентификаторСтроки); 
	Если СтрокаДерева["Оплата_"+Постфикс] = 0 Тогда
		Возврат;
	КонецЕсли;    
	
	Если Не ЗначениеЗаполнено(СтрокаДерева.СтавкаНДС) Тогда 
		СтрокаДерева.СтавкаНДС =  СтрокаДерева.СтавкаНДСИсходная;    
	КонецЕсли;
	ЗначениеСтавки = CW_Финансы.ПолучитьСтавкуНДС(СтрокаДерева.СтавкаНДС)/100;

	Если СтрокаДерева["Задолженность"+ПостфиксЗадолженность] = 0 Тогда
		
		// при расчетах в у.е. сумму НДС рассчитываем от рублевого эквивалента оплаты
		Если УЕ Тогда
			СтрокаДерева.СуммаНДС = Окр(СтрокаДерева["Оплата_БВ"]  * ЗначениеСтавки/(1+ЗначениеСтавки),2,1);
		Иначе
			СтрокаДерева.СуммаНДС = Окр(СтрокаДерева["Оплата_"+Постфикс]  * ЗначениеСтавки/(1+ЗначениеСтавки),2,1);
		КонецЕсли;
	Иначе
		Если СтрокаДерева = Неопределено 
			или СтрокаДерева.СуммаДокумента = 0 Тогда
			КоэффициентОплаты = 0; 
		Иначе
			КоэффициентОплаты = СтрокаДерева["Оплата_Валюта"] / СтрокаДерева.СуммаДокумента;
		КонецЕсли;
		
		Если КоэффициентОплаты < 1 Тогда
			СтрокаДерева.СуммаНДС = Окр(СтрокаДерева.СуммаНДСИсходная * КоэффициентОплаты, 2);
		Иначе
			СтрокаДерева.СуммаНДС = СтрокаДерева.СуммаНДСИсходная;
		КонецЕсли;  
	КонецЕсли; 
	
	РодительСтроки  = СтрокаДерева.ПолучитьРодителя();
	Если РодительСтроки <> Неопределено Тогда
		ПересчитатьСуммуНДСРодителя(РодительСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуНДСРодителя(РодительСтроки)
	
	ЭлементыРодителя = РодительСтроки.ПолучитьЭлементы();
	
	СуммаНДС = 0;
	Для Каждого ПодчиненнаяСтрока из ЭлементыРодителя Цикл
		СуммаНДС = СуммаНДС + ПодчиненнаяСтрока.СуммаНДС;
	КонецЦикла;
	
	РодительСтроки.СуммаНДС = СуммаНДС;

КонецПроцедуры   


&НаКлиенте
Процедура ДеревоОплатСуммаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоОплат.ТекущаяСтрока;
	ДеревоОплатСуммаНДСПриИзмененииНаСервере(ТекущаяСтрока);

КонецПроцедуры 

&НаСервере
Процедура ДеревоОплатСуммаНДСПриИзмененииНаСервере(ИдентификаторСтроки)
	
	СтрокаДерева = ДеревоОплат.НайтиПоИдентификатору(ИдентификаторСтроки); 
	РодительСтроки  = СтрокаДерева.ПолучитьРодителя();
	Если РодительСтроки <> Неопределено Тогда
		ПересчитатьСуммуНДСРодителя(РодительСтроки);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция _ПроверитьКорректностьОплаты_БВ(ТС)
	
	СтрукутраКурса = CW_Финансы.ПолучитьКурсВалюты(Валюта, Дата);
	
	// пересчитываем валютную сумму по курсу
		
	СтрокаДерева = ДеревоОплат.НайтиПоИдентификатору(ТС);
	Если СтрокаДерева.Оплата_Валюта = 0 И СтрокаДерева.Курс <> 0 Тогда
		
		Если (РежимДДС) Тогда
			
			СтрокаДерева.Курс = КроссКурс;
			СтрокаДерева.Оплата_Валюта = _сф.БезопасноРазделить(СтрокаДерева.Оплата_БВ,СтрокаДерева.Курс / СтрукутраКурса.Кратность);
			
		Иначе
			
			СтрокаДерева.Оплата_Валюта = _сф.БезопасноРазделить(СтрокаДерева.Оплата_БВ,СтрокаДерева.Курс / СтрукутраКурса.Кратность);
			//_ПроверитьКорректностьОплаты(ТС);
			
		КонецЕсли; 
		
	Иначе
		
		СтрокаДерева.Курс = _сф.БезопасноРазделить(СтрокаДерева.Оплата_БВ,СтрокаДерева.Оплата_Валюта) * СтрукутраКурса.Кратность;
		
	КонецЕсли; 
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОчиститьОплаты(Команда)
	
	АвтоматическийПодборСчетов = Ложь;
	Для каждого СтрокаСчета Из ДеревоОплат.ПолучитьЭлементы() Цикл
		
		СтрокаСчета.Оплата_Валюта = 0;
		
		Если УЕ Тогда
			СтрокаСчета.Оплата_БВ = 0;
		КонецЕсли; 
		
		СтрокаСчета.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");  
		СтрокаСчета.СуммаНДС  = 0;

		Для каждого СтрокаАкта Из СтрокаСчета.ПолучитьЭлементы() Цикл
			
			СтрокаАкта.Оплата_Валюта = 0;
			
			Если УЕ Тогда
				СтрокаАкта.Оплата_БВ = 0;
			КонецЕсли; 
			
			СтрокаАкта.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");  
			СтрокаАкта.СуммаНДС  = 0;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	ОбновитьИтоги();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаСуммыДокументов(Команда)
	
	Если Элементы.ДеревоОплатКомандаСуммыДокументов.Пометка Тогда
		Элементы.ДеревоОплатКомандаСуммыДокументов.Пометка = Ложь;
	Иначе
		Элементы.ДеревоОплатКомандаСуммыДокументов.Пометка = Истина;
	КонецЕсли; 
	
	// регенерируем форму
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПроверитьСвертку",1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСвертку()
	// --- 
	
	Если (СтрокиСвернуты) Тогда
		
		СвернутьСтроки();
		
	Иначе
		
		РазвернутьСтроки();
		
	КонецЕсли; 
	
	Элементы.ДеревоОплат.Обновить();
	
	// --- 
КонецПроцедуры
  

// --- 

&НаКлиенте
Процедура РазвернутьДокументы(Команда)
	
	СтрокиСвернуты = Ложь;
	РазвернутьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтроки()
	// --- 
	
	Для каждого Стр Из ДеревоОплат.ПолучитьЭлементы() Цикл
		
		Элементы.ДеревоОплат.Развернуть(Стр.ПолучитьИдентификатор(),Истина);
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура СвернутьДокументы(Команда)
	
	СтрокиСвернуты = Истина;
	СвернутьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСтроки()
	// --- 
	
	Для каждого Стр Из ДеревоОплат.ПолучитьЭлементы() Цикл
		
		Элементы.ДеревоОплат.Свернуть(Стр.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Автозаполнение(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение, СуммаОплаты, "Введите сумму оплаты", 15, 2);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Число, Параметры) Экспорт
	
	Если НЕ Число = Неопределено Тогда
		// обработка введенного количества
		СуммаОплаты = Число;
		
		_ВыполнитьАвтозаполнение();	
		
		ОбновитьИтоги();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ВыполнитьАвтозаполнение()
	
	// курс
	// сумма оплаты
	// ДеревоОплат
	
	СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(Валюта,Дата);
	CW_Финансы.ВыполнитьАвтораспределениеОплатыПоСчетам(ДеревоОплат,СуммаОплаты, ПустойАкт,УЕ,СтруктураКурса);
	
	ЭлементыДерева = ДеревоОплат.ПолучитьЭлементы(); 
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл
		ПересчитатьСтавкуНДСПоСтрокеРекунсивно(ЭлементДерева);       
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ПересчитатьСтавкуНДСПоСтрокеРекунсивно(ЭлементДерева) 
	
	ИдентификаторСтроки = ЭлементДерева.ПолучитьИдентификатор();
	
	ПересчитатьСтавкуНДСПоСтроке(ИдентификаторСтроки);
	ПересчитатьСтавкуНДСПоСтроке(ИдентификаторСтроки, "БВ");  
	
	ЭлементыДерева = ЭлементДерева.ПолучитьЭлементы(); 
	Для Каждого ПодчиненныйЭлементДерева из ЭлементыДерева Цикл
		ПересчитатьСтавкуНДСПоСтрокеРекунсивно(ПодчиненныйЭлементДерева);       
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура АвтоматическийПодборСчетовПриИзменении(Элемент)
	
	Если (АвтоматическийПодборСчетов) Тогда
		
		_ВыполнитьАвтозаполнение();
		ОбновитьИтоги();
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ДеревоОплатКурсПриИзменении(Элемент)
	
	//СписаниеСРасчетногоСчетаФормыКлиент.РасшифровкаПлатежаКурсВзаиморасчетовПриИзменении(ЭтотОбъект, Элемент);
	
	_ПриИзмененииКурса(Элементы.ДеревоОплат.ТекущаяСтрока);
	РассчитатьСуммыОплатыПриИзмененииКурса(Элементы.ДеревоОплат.ТекущаяСтрока);
	ОбновитьИтоги();
	
КонецПроцедуры

Функция РассчитатьСуммыОплатыПриИзмененииКурса(ТС)   
	
	СтрокаДерева = ДеревоОплат.НайтиПоИдентификатору(ТС);
	// --- 
	Если (СтрокаДерева.Оплата_Валюта <= 0) Тогда
		
		СтрокаДерева.Оплата_Валюта = 0;
		СтрокаДерева.Оплата_БВ = 0;		
			
	КонецЕсли; 
	Если (СтрокаДерева.Оплата_БВ < 0) Тогда
		
		СтрокаДерева.Оплата_БВ = 0;	
		
	КонецЕсли; 
	
	//Для получения кратности
	СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(Валюта,Дата);
	//Для получения кратности
	
	
	// --- 
	Если (РежимДДС) Тогда
		
		// пересчитываем по кросс-курсу из шапки
		СтрокаДерева.Курс = КроссКурс;
		СтрокаДерева.Оплата_БВ = Окр(СтрокаДерева.Оплата_Валюта*СтрокаДерева.Курс / СтруктураКурса.Кратность, 2);
		
	Иначе
		
		Если УЕ Тогда
			
			Если СтрокаДерева.Курс = 0 Тогда
				
				СтрокаДерева.Курс 		= СтруктураКурса.Курс;
				СтрокаДерева.Оплата_БВ 	= ОКР(СтрокаДерева.Оплата_Валюта*СтрокаДерева.Курс / СтруктураКурса.Кратность, 2);
				
			Иначе
				
				Если СтрокаДерева.Оплата_БВ = 0 Тогда
					
					СтрокаДерева.Оплата_БВ = ОКР(СтрокаДерева.Оплата_Валюта*СтрокаДерева.Курс / СтруктураКурса.Кратность, 2);
					
				Иначе
					
					СтрокаДерева.Оплата_Валюта = ОКР(СтрокаДерева.Оплата_БВ / СтрокаДерева.Курс * СтруктураКурса.Кратность, 2);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
	Если СтрокаДерева.ЭтоСчет Тогда
		
		ОплатаПоСчету = СтрокаДерева.Оплата_Валюта;
		ОплатаПоАктам = 0;
		Для каждого СтрокаАкта Из СтрокаДерева.ПолучитьЭлементы() Цикл
			
			_сф.Инкремент(ОплатаПоАктам,СтрокаАкта.Оплата_Валюта);
			
		КонецЦикла; 
		Если ОплатаПоАктам > ОплатаПоСчету Тогда
			
			СтрокаДерева.Оплата_Валюта = ОплатаПоАктам;
			_ПроверитьКорректностьОплаты(СтрокаДерева.ПолучитьИдентификатор());
			
		КонецЕсли; 
				
	Иначе
		
		СтрокаСчета = СтрокаДерева.ПолучитьРодителя();
		ОплатаПоСчету = СтрокаСчета.Оплата_Валюта;
		ОплатаПоАктам = 0;
		Для каждого СтрокаАкта Из СтрокаСчета.ПолучитьЭлементы() Цикл
			
			_сф.Инкремент(ОплатаПоАктам,СтрокаАкта.Оплата_Валюта);
			
		КонецЦикла; 
		Если ОплатаПоАктам > ОплатаПоСчету Тогда
			
			СтрокаСчета.Оплата_Валюта = ОплатаПоАктам;
			_ПроверитьКорректностьОплаты(СтрокаСчета.ПолучитьИдентификатор());
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат _УФКС.Ответ();

КонецФункции


&НаСервере
Процедура _ПриИзмененииКурса(ТС)
	// --- 
	
	СтрокаДерева = ДеревоОплат.НайтиПоИдентификатору(ТС);
	Если (СтрокаДерева.Оплата_БВ = 0) Тогда
		СтрокаДерева.Оплата_БВ = СтрокаДерева.Оплата_Валюта*СтрокаДерева.Курс;
	Иначе
		
		СтрокаДерева.Оплата_Валюта = СтрокаДерева.Оплата_БВ/СтрокаДерева.Курс;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатКурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РасшифровкаПлатежаКурсВзаиморасчетовНачалоВыбора(
		ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаКурсВзаиморасчетовНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаПлатеж = Элементы.ДеревоОплат.ТекущиеДанные;
	// --- 
	ПараметрыДокумента = Новый Структура("ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, Дата");
	ПараметрыДокумента.ДоговорКонтрагента = УчетныйДоговор;
	ПараметрыДокумента.КурсВзаиморасчетов = СтрокаПлатеж.Курс;
	ПараметрыДокумента.КратностьВзаиморасчетов = 1;
	ПараметрыДокумента.Дата = Дата;
	
	// --- 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтрокаПлатеж", 	СтрокаПлатеж);
	ДополнительныеПараметры.Вставить("Форма", 			Форма);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("РасшифровкаПлатежаКурсВзаиморасчетовНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Общаяформа.ФормаВводаКурсаИКратности", ПараметрыДокумента,,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаКурсВзаиморасчетовНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	СтрокаПлатеж 	= ДополнительныеПараметры.СтрокаПлатеж;
	СтруктураКурсаИКратности = РезультатЗакрытия;
	//
	Если СтруктураКурсаИКратности <> Неопределено Тогда
		СтрокаПлатеж.Курс      = СтруктураКурсаИКратности.КурсВалюты;
		_ПриИзмененииКурса(Элементы.ДеревоОплат.ТекущаяСтрока);
		_ПроверитьКорректностьОплаты(Элементы.ДеревоОплат.ТекущаяСтрока);
		ОбновитьИтоги();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОплатСтавкаНДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ТекущиеДанные = Элементы.ДеревоОплат.ТекущиеДанные;
	//СтандартнаяОбработка =  СтрНайти(ТекущиеДанные.Представление, "Аванс") <> 0;		
	
КонецПроцедуры 


&НаКлиенте
Процедура ДеревоОплатСтавкаНДСПриИзменении(Элемент)

	ПересчитатьСтавкуНДСПоСтроке(Элементы.ДеревоОплат.ТекущаяСтрока);
	ОбновитьИтоги();

КонецПроцедуры


//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	
	ПриложениеКДоговоруПриИзмененииНаСервере();
	
КонецПроцедуры  

&НаСервере
Процедура ПриложениеКДоговоруПриИзмененииНаСервере()
	
	Если Не ПриложениеКДоговору.Пустая() Тогда
		УстановитьПараметриыПриложенияДоговора(ПриложениеКДоговору);
	Иначе
		УстановитьПараметриыПриложенияДоговора(Договор);
	КонецЕсли;
	
	УстановитьПараметрыБухгалтерскогоУчета();
	УстаноитьЗаголовкиЭлементов();

	_УправлениеЭлементамиФормы();
	_ОбновитьДерево();

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	Если Не ПроверитьДоговор() Тогда
		ПоказатьПредупреждение(,"Договор не может быть использован для этого документа!");
		Договор = Неопределено;
		Возврат;
	КонецЕсли;
	
	ПриИзмененииДоговораНаСервере(); 
	
КонецПроцедуры  

&НаСервере
Функция ПроверитьДоговор() 
	
	Если ВалютаДокумента = БазоваяВалюта Тогда
		Если Договор.ВалютаДоговора = БазоваяВалюта или Договор.ВзаиморасчетыВУЕ Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если Договор.ВалютаДоговора <> БазоваяВалюта и Не Договор.ВзаиморасчетыВУЕ Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииДоговораНаСервере()
	
	УстановитьПараметриыПриложенияДоговора(Договор);
	
	УстановитьВидимостьПриложения();
	УстановитьПараметрыБухгалтерскогоУчета();
	
	УстаноитьЗаголовкиЭлементов();
	_УправлениеЭлементамиФормы();
	_ОбновитьДерево();
	
КонецПроцедуры    

&НаСервере
Процедура УстановитьПараметриыПриложенияДоговора(ДоговорПриложение)
	
	Валюта  = ДоговорПриложение.ВалютаДоговора;
	УЕ		= ДоговорПриложение.ВзаиморасчетыВУЕ;  
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьПриложения()
	
	ПараметрыОпции = Новый Структура("CW_ДоговорПоГрузоперевозкам", Договор);
	Элементы.ПриложениеКДоговору.Видимость = ПолучитьФункциональнуюОпцию("CW_УчитыватьПриложенияВДокументах", ПараметрыОпции);
	
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров
